{
  "legal": {
    "terms": {
      "title": "شروط الخدمة",
      "lastUpdated": "آخر تحديث: 26 يوليو 2025",
      "introductionTitle": "1. مقدمة",
      "introductionContent": "مرحبًا بك في موقعنا العقاري. تحكم شروط الخدمة هذه (\"الشروط\") استخدامك لموقعنا وخدماتنا. من خلال الوصول إلى موقعنا أو استخدامه ، فإنك توافق على الالتزام بهذه الشروط.",
      "useOfServicesTitle": "2. استخدام خدماتنا",
      "useOfServicesContent": "لا يجوز لك استخدام خدماتنا إلا للأغراض المشروعة ووفقًا لهذه الشروط. أنت توافق على عدم استخدام خدماتنا:",
      "useOfServicesListItem1": "بأي طريقة تنتهك أي قانون أو لائحة اتحادية أو حكومية أو محلية أو دولية معمول بها.",
      "useOfServicesListItem2": "لإرسال أو شراء إرسال أي مواد إعلانية أو ترويجية ، بما في ذلك أي \"بريد غير مرغوب فيه\" أو \"رسالة متسلسلة\" أو \"بريد عشوائي\" أو أي طلب آخر مشابه.",
      "useOfServicesListItem3": "لانتحال شخصية أو محاولة انتحال شخصية الشركة أو موظف في الشركة أو مستخدم آخر أو أي شخص أو كيان آخر.",
      "intellectualPropertyTitle": "3. حقوق الملكية الفكرية",
      "intellectualPropertyContent": "الموقع الإلكتروني وجميع محتوياته وميزاته ووظائفه (بما في ذلك على سبيل المثال لا الحصر جميع المعلومات والبرامج والنصوص والشاشات والصور والفيديو والصوت والتصميم والاختيار والترتيب الخاص بها) مملوكة للشركة أو مرخصيها أو مقدمي خدمات آخرين لهذه المواد وهي محمية بموجب قوانين حقوق النشر والعلامات التجارية وبراءات الاختراع والأسرار التجارية وغيرها من قوانين الملكية الفكرية أو حقوق الملكية في الولايات المتحدة وعلى الصعيد الدولي.",
      "disclaimerOfWarrantiesTitle": "4. إخلاء المسؤولية عن الضمانات",
      "disclaimerOfWarrantiesContent": "المعلومات المقدمة على الموقع أو من خلاله متاحة فقط لأغراض المعلومات العامة. نحن لا نضمن دقة أو اكتمال أو فائدة هذه المعلومات. أي اعتماد تضعه على هذه المعلومات هو على مسؤوليتك الخاصة تمامًا.",
      "limitationOnLiabilityTitle": "5. تحديد المسؤولية",
      "limitationOnLiabilityContent": "لن تكون الشركة أو الشركات التابعة لها أو مرخصوها أو مقدمو الخدمات أو الموظفون أو الوكلاء أو المسؤولون أو المديرون مسؤولين بأي حال من الأحوال عن الأضرار من أي نوع ، بموجب أي نظرية قانونية ، تنشأ عن أو فيما يتعلق باستخدامك أو عدم قدرتك على استخدام الموقع الإلكتروني أو أي مواقع ويب مرتبطة به أو أي محتوى على الموقع الإلكتروني أو مواقع الويب الأخرى هذه ، بما في ذلك أي أضرار مباشرة أو غير مباشرة أو خاصة أو عرضية أو تبعية أو عقابية ، بما في ذلك على سبيل المثال لا الحصر ، الإصابة الشخصية والألم والمعاناة والضيق العاطفي وفقدان الإيرادات وفقدان الأرباح وفقدان الأعمال أو المدخرات المتوقعة وفقدان الاستخدام وفقدان السمعة الحسنة وفقدان البيانات ، وسواء كان ذلك ناتجًا عن ضرر (بما في ذلك الإهمال) أو خرق العقد أو غير ذلك ، حتى لو كان متوقعًا.",
      "governingLawTitle": "6. القانون الحاكم والاختصاص القضائي",
      "governingLawContent": "تخضع جميع الأمور المتعلقة بالموقع الإلكتروني وهذه الشروط وأي نزاع أو مطالبة تنشأ عنها أو تتعلق بها (في كل حالة ، بما في ذلك النزاعات أو المطالبات غير التعاقدية) وتفسر وفقًا للقوانين الداخلية لولاية [ولايتك] دون تفعيل أي خيار أو تعارض في أحكام أو قواعد القانون.",
      "changesToTermsTitle": "7. التغييرات على شروط الخدمة",
      "changesToTermsContent": "يجوز لنا مراجعة وتحديث شروط الخدمة هذه من وقت لآخر وفقًا لتقديرنا الخاص. تسري جميع التغييرات فور نشرها.",
      "contactTitle": "8. معلومات الاتصال",
      "contactContent": "لطرح الأسئلة أو التعليق على شروط الخدمة هذه ، اتصل بنا على: [معلومات الاتصال الخاصة بك]"
    },
    "policy": {
      "title": "سياسة الخصوصية",
      "lastUpdated": "آخر تحديث: 26 يوليو 2025",
      "introductionTitle": "1. مقدمة",
      "introductionContent": "نحن نحترم خصوصيتك ونلتزم بحمايتها من خلال امتثالنا لهذه السياسة. تصف هذه السياسة أنواع المعلومات التي قد نجمعها منك أو التي قد تقدمها عند زيارة موقعنا الإلكتروني وممارساتنا لجمع هذه المعلومات واستخدامها وصيانتها وحمايتها والكشف عنها.",
      "informationWeCollectTitle": "2. المعلومات التي نجمعها عنك",
      "informationWeCollectContent": "نحن نجمع عدة أنواع من المعلومات من وعن مستخدمي موقعنا الإلكتروني ، بما في ذلك المعلومات:",
      "informationWeCollectListItem1": "التي يمكن من خلالها تحديد هويتك الشخصية ، مثل الاسم والعنوان البريدي وعنوان البريد الإلكتروني ورقم الهاتف أو أي معرف آخر يمكن من خلاله الاتصال بك عبر الإنترنت أو دون اتصال (\"المعلومات الشخصية\").",
      "informationWeCollectListItem2": "التي تتعلق بك ولكنها لا تحدد هويتك بشكل فردي ، مثل عنوان IP الخاص بك ونوع المتصفح ونظام التشغيل.",
      "informationWeCollectListItem3": "حول اتصالك بالإنترنت والمعدات التي تستخدمها للوصول إلى موقعنا الإلكتروني وتفاصيل الاستخدام.",
      "howWeUseYourInformationTitle": "3. كيف نستخدم معلوماتك",
      "howWeUseYourInformationContent": "نحن نستخدم المعلومات التي نجمعها عنك أو التي تقدمها لنا ، بما في ذلك أي معلومات شخصية:",
      "howWeUseYourInformationListItem1": "لتقديم موقعنا الإلكتروني ومحتوياته لك.",
      "howWeUseYourInformationListItem2": "لتزويدك بالمعلومات أو المنتجات أو الخدمات التي تطلبها منا.",
      "howWeUseYourInformationListItem3": "لتحقيق أي غرض آخر تقدمه من أجله.",
      "howWeUseYourInformationListItem4": "لتنفيذ التزاماتنا وإنفاذ حقوقنا الناشئة عن أي عقود مبرمة بينك وبيننا ، بما في ذلك الفوترة والتحصيل.",
      "howWeUseYourInformationListItem5": "لإعلامك بالتغييرات التي تطرأ على موقعنا الإلكتروني أو أي منتجات أو خدمات نقدمها أو نوفرها من خلاله.",
      "disclosureOfYourInformationTitle": "4. الكشف عن معلوماتك",
      "disclosureOfYourInformationContent": "يجوز لنا الكشف عن معلومات مجمعة حول مستخدمينا ، ومعلومات لا تحدد هوية أي فرد ، دون قيود. يجوز لنا الكشف عن المعلومات الشخصية التي نجمعها أو تقدمها كما هو موضح في سياسة الخصوصية هذه:",
      "disclosureOfYourInformationListItem1": "لشركاتنا التابعة والفرعية.",
      "disclosureOfYourInformationListItem2": "للمقاولين ومقدمي الخدمات والأطراف الثالثة الأخرى التي نستخدمها لدعم أعمالنا.",
      "disclosureOfYourInformationListItem3": "لمشترٍ أو خلف آخر في حالة الاندماج أو التجريد أو إعادة الهيكلة أو إعادة التنظيم أو الحل أو البيع أو النقل الآخر لبعض أو كل أصولنا.",
      "disclosureOfYourInformationListItem4": "لتحقيق الغرض الذي تقدمه من أجله.",
      "dataSecurityTitle": "5. أمن البيانات",
      "dataSecurityContent": "لقد قمنا بتنفيذ تدابir مصممة لتأمين معلوماتك الشخصية من الفقد العرضي ومن الوصول والاستخدام والتغيير والكشف غير المصرح به. تعتمد سلامة وأمن معلوماتك أيضًا عليك. حيث قدمنا لك (أو حيث اخترت) كلمة مرور للوصول إلى أجزاء معينة من موقعنا الإلكتروني ، فأنت مسؤول عن الحفاظ على سرية كلمة المرور هذه.",
      "changesToPolicyTitle": "6. التغييرات على سياسة الخصوصية الخاصة بنا",
      "changesToPolicyContent": "من سياستنا نشر أي تغييرات نجريها على سياسة الخصوصية الخاصة بنا على هذه الصفحة. إذا قمنا بإجراء تغييرات جوهرية على كيفية تعاملنا مع المعلومات الشخصية لمستخدمينا ، فسنخطرك من خلال إشعار على الصفحة الرئيسية للموقع الإلكتروني.",
      "contactTitle": "7. معلومات الاتصال",
      "contactContent": "لطرح الأسئلة أو التعليق على سياسة الخصوصية هذه وممارسات الخصوصية لدينا ، اتصل بنا على: [معلومات الاتصال الخاصة بك]"
    }
  }
}