{
  "legal": {
    "terms": {
      "title": "Terms of Service",
      "lastUpdated": "Last updated: July 26, 2025",
      "introductionTitle": "1. Introduction",
      "introductionContent": "Welcome to our real estate website. These Terms of Service (\"Terms\") govern your use of our website and services. By accessing or using our website, you agree to be bound by these Terms.",
      "useOfServicesTitle": "2. Use of Our Services",
      "useOfServicesContent": "You may use our services only for lawful purposes and in accordance with these Terms. You agree not to use our services:",
      "useOfServicesListItem1": "In any way that violates any applicable federal, state, local, or international law or regulation.",
      "useOfServicesListItem2": "To transmit, or procure the sending of, any advertising or promotional material, including any \"junk mail,\" \"chain letter,\" \"spam,\" or any other similar solicitation.",
      "useOfServicesListItem3": "To impersonate or attempt to impersonate the Company, a Company employee, another user, or any other person or entity.",
      "intellectualPropertyTitle": "3. Intellectual Property Rights",
      "intellectualPropertyContent": "The website and its entire contents, features, and functionality (including but not limited to all information, software, text, displays, images, video, and audio, and the design, selection, and arrangement thereof) are owned by the Company, its licensors, or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret, and other intellectual property or proprietary rights laws.",
      "disclaimerOfWarrantiesTitle": "4. Disclaimer of Warranties",
      "disclaimerOfWarrantiesContent": "The information presented on or through the website is made available solely for general information purposes. We do not warrant the accuracy, completeness, or usefulness of this information. Any reliance you place on such information is strictly at your own risk.",
      "limitationOnLiabilityTitle": "5. Limitation on Liability",
      "limitationOnLiabilityContent": "In no event will the Company, its affiliates, or their licensors, service providers, employees, agents, officers, or directors be liable for damages of any kind, under any legal theory, arising out of or in connection with your use, or inability to use, the website, any websites linked to it, any content on the website or such other websites, including any direct, indirect, special, incidental, consequential, or punitive damages, including but not limited to, personal injury, pain and suffering, emotional distress, loss of revenue, loss of profits, loss of business or anticipated savings, loss of use, loss of goodwill, loss of data, and whether caused by tort (including negligence), breach of contract, or otherwise, even if foreseeable.",
      "governingLawTitle": "6. Governing Law and Jurisdiction",
      "governingLawContent": "All matters relating to the website and these Terms, and any dispute or claim arising therefrom or related thereto (in each case, including non-contractual disputes or claims), shall be governed by and construed in accordance with the internal laws of the State of [Your State] without giving effect to any choice or conflict of law provision or rule.",
      "changesToTermsTitle": "7. Changes to the Terms of Service",
      "changesToTermsContent": "We may revise and update these Terms of Service from time to time in our sole discretion. All changes are effective immediately when we post them.",
      "contactTitle": "8. Contact Information",
      "contactContent": "To ask questions or comment about these Terms of Service, contact us at: [Your Contact Information]"
    },
    "policy": {
      "title": "Privacy Policy",
      "lastUpdated": "Last updated: July 26, 2025",
      "introductionTitle": "1. Introduction",
      "introductionContent": "We respect your privacy and are committed to protecting it through our compliance with this policy. This policy describes the types of information we may collect from you or that you may provide when you visit our website and our practices for collecting, using, maintaining, protecting, and disclosing that information.",
      "informationWeCollectTitle": "2. Information We Collect About You",
      "informationWeCollectContent": "We collect several types of information from and about users of our website, including information:",
      "informationWeCollectListItem1": "By which you may be personally identified, such as name, postal address, e-mail address, telephone number, or any other identifier by which you may be contacted online or offline (\"personal information\").",
      "informationWeCollectListItem2": "That is about you but individually does not identify you, such as your IP address, browser type, and operating system.",
      "informationWeCollectListItem3": "About your internet connection, the equipment you use to access our website, and usage details.",
      "howWeUseYourInformationTitle": "3. How We Use Your Information",
      "howWeUseYourInformationContent": "We use information that we collect about you or that you provide to us, including any personal information:",
      "howWeUseYourInformationListItem1": "To present our website and its contents to you.",
      "howWeUseYourInformationListItem2": "To provide you with information, products, or services that you request from us.",
      "howWeUseYourInformationListItem3": "To fulfill any other purpose for which you provide it.",
      "howWeUseYourInformationListItem4": "To carry out our obligations and enforce our rights arising from any contracts entered into between you and us, including for billing and collection.",
      "howWeUseYourInformationListItem5": "To notify you about changes to our website or any products or services we offer or provide through it.",
      "disclosureOfYourInformationTitle": "4. Disclosure of Your Information",
      "disclosureOfYourInformationContent": "We may disclose aggregated information about our users, and information that does not identify any individual, without restriction. We may disclose personal information that we collect or you provide as described in this privacy policy:",
      "disclosureOfYourInformationListItem1": "To our subsidiaries and affiliates.",
      "disclosureOfYourInformationListItem2": "To contractors, service providers, and other third parties we use to support our business.",
      "disclosureOfYourInformationListItem3": "To a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution, or other sale or transfer of some or all of our assets.",
      "disclosureOfYourInformationListItem4": "To fulfill the purpose for which you provide it.",
      "dataSecurityTitle": "5. Data Security",
      "dataSecurityContent": "We have implemented measures designed to secure your personal information from accidental loss and from unauthorized access, use, alteration, and disclosure. The safety and security of your information also depends on you. Where we have given you (or where you have chosen) a password for access to certain parts of our website, you are responsible for keeping this password confidential.",
      "changesToPolicyTitle": "6. Changes to Our Privacy Policy",
      "changesToPolicyContent": "It is our policy to post any changes we make to our privacy policy on this page. If we make material changes to how we treat our users' personal information, we will notify you through a notice on the website home page.",
      "contactTitle": "7. Contact Information",
      "contactContent": "To ask questions or comment about this privacy policy and our privacy practices, contact us at: [Your Contact Information]"
    }
  }
}